# Part - A Data Preprocessing

#### Importing libraries and datasets

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## 1. Read the three csv files which contains the score of same students in term1 for each Subject

In [2]:
math_score = pd.read_csv('MathScoreTerm1.csv')
ds_score = pd.read_csv('DSScoreTerm1.csv')
physics_score = pd.read_csv('PhysicsScoreTerm1.csv')

In [3]:
math_score.head()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

In [4]:
ds_score.head()

             Name  Score  Age         Ethinicity        Subject Sex  ID
0  AI-KYUNG CHUNG   82.0   18     White American  Data Structue   M   1
1     ALAN HARVEY   79.0   19  European American  Data Structue   M   2
2    ALAN REYNAUD   39.0   19  European American  Data Structue   M   3
3  ALBERT CENDANA   76.0   18     White American  Data Structue   M   4
4  ALBERT HOLT JR   76.0   18     White American  Data Structue   F   5

In [5]:
physics_score.head()

             Name  Score  Age         Ethinicity  Subject Sex  ID
0  AI-KYUNG CHUNG   84.0   18     White American  Physics   M   1
1     ALAN HARVEY   81.0   19  European American  Physics   M   2
2    ALAN REYNAUD   41.0   19  European American  Physics   M   3
3  ALBERT CENDANA   78.0   18     White American  Physics   M   4
4  ALBERT HOLT JR   78.0   18     White American  Physics   F   5

In [6]:
math_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       596 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    object
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.9+ KB

In [7]:
ds_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       591 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    object
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.9+ KB

In [8]:
physics_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        599 non-null    object
 1   Score       593 non-null    float64
 2   Age         599 non-null    int64
 3   Ethinicity  599 non-null    object
 4   Subject     599 non-null    object
 5   Sex         599 non-null    object
 6   ID          599 non-null    int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.9+ KB

## 2. Remove the name and ethnicity column (to ensure confidentiality)

In [9]:
math_score1 = math_score.drop(columns=['Name','Ethinicity'])
ds_score1 = ds_score.drop(columns=['Name','Ethinicity'])
physics_score1 = physics_score.drop(columns=['Name','Ethinicity'])

In [10]:
math_score1.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [11]:
ds_score1.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

In [12]:
physics_score1.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

## 3. Fill missing score data with zero

In [13]:
math_score1.fillna(0, inplace=True)
ds_score1.fillna(0, inplace=True)
physics_score1.fillna(0, inplace=True)

## 4. Merge the three files

In [14]:
all_scores_merged = math_score1.merge(ds_score1, on=['ID', 'Age', 'Sex'], how='left').merge(physics_score1, on=['ID', 'Age', 'Sex'], how='left')

In [15]:
all_scores_merged.head()

   Score_x  Age Subject_x Sex  ID  Score_y      Subject_y  Score  Subject
0     88.0   18     Maths   M   1     82.0  Data Structue   84.0  Physics
1     85.0   19     Maths   M   2     79.0  Data Structue   81.0  Physics
2     45.0   19     Maths   M   3     39.0  Data Structue   41.0  Physics
3     82.0   18     Maths   M   4     76.0  Data Structue   78.0  Physics
4     82.0   18     Maths   F   5     76.0  Data Structue   78.0  Physics

## 5. Change Sex(M/F) Column to 1/2 for further analysis

In [16]:
all_scores_merged['Sex'] = [1 if i=='M' else 2 for i in all_scores_merged['Sex']]

In [17]:
all_scores_merged.head()

   Score_x  Age Subject_x  Sex  ID  Score_y      Subject_y  Score  Subject
0     88.0   18     Maths    1   1     82.0  Data Structue   84.0  Physics
1     85.0   19     Maths    1   2     79.0  Data Structue   81.0  Physics
2     45.0   19     Maths    1   3     39.0  Data Structue   41.0  Physics
3     82.0   18     Maths    1   4     76.0  Data Structue   78.0  Physics
4     82.0   18     Maths    2   5     76.0  Data Structue   78.0  Physics

## 6. Store the data in new file â€“ScoreFinal.csv

In [18]:
all_scores_merged.to_csv('ScoreFinal.csv')

## 7. Convert ethnicity to numerical value

In [19]:
ethinicity= pd.get_dummies(math_score['Ethinicity'])
new_data = math_score.drop(['Ethinicity'], axis=1)
math_score2 = pd.concat((new_data, ethinicity), axis=1)

ethinicity= pd.get_dummies(ds_score['Ethinicity'])
new_data = ds_score.drop(['Ethinicity'], axis=1)
ds_score2 = pd.concat((new_data, ethinicity), axis=1)

ethinicity= pd.get_dummies(physics_score['Ethinicity'])
new_data = physics_score.drop(['Ethinicity'], axis=1)
physics_score2 = pd.concat((new_data, ethinicity), axis=1)

In [20]:
math_score2.head()

,Name,Score,Age,Subject,Sex,ID,African American,European American,Hispanic,White American
0,AI-KYUNG CHUNG,88.0,18,Maths,M,1,0,0,0,1
1,ALAN HARVEY,85.0,19,Maths,M,2,0,1,0,0
2,ALAN REYNAUD,45.0,19,Maths,M,3,0,1,0,0
3,ALBERT CENDANA,82.0,18,Maths,M,4,0,0,0,1
4,ALBERT HOLT JR,82.0,18,Maths,F,5,0,0,0,1

In [21]:
physics_score2.head()

,Name,Score,Age,Subject,Sex,ID,African American,European American,Hispanic,White American
0,AI-KYUNG CHUNG,84.0,18,Physics,M,1,0,0,0,1
1,ALAN HARVEY,81.0,19,Physics,M,2,0,1,0,0
2,ALAN REYNAUD,41.0,19,Physics,M,3,0,1,0,0
3,ALBERT CENDANA,78.0,18,Physics,M,4,0,0,0,1
4,ALBERT HOLT JR,78.0,18,Physics,F,5,0,0,0,1

In [22]:
ds_score2.head()

,Name,Score,Age,Subject,Sex,ID,African American,European American,Hispanic,White American
0,AI-KYUNG CHUNG,82.0,18,Data Structue,M,1,0,0,0,1
1,ALAN HARVEY,79.0,19,Data Structue,M,2,0,1,0,0
2,ALAN REYNAUD,39.0,19,Data Structue,M,3,0,1,0,0
3,ALBERT CENDANA,76.0,18,Data Structue,M,4,0,0,0,1
4,ALBERT HOLT JR,76.0,18,Data Structue,F,5,0,0,0,1

## 8. Fill the missing score for a student to the average of the class

In [23]:
math_score.isnull().sum()

Name          0
Score         3
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [24]:
ds_score.isnull().sum()

Name          0
Score         8
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [25]:
physics_score.isnull().sum()

Name          0
Score         6
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [26]:
math_score.fillna(math_score.mean(), inplace=True)
ds_score.fillna(ds_score.mean(), inplace=True)
physics_score.fillna(physics_score.mean(), inplace=True)

C:\Users\bhave\AppData\Local\Temp/ipykernel_4556/946556448.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  math_score.fillna(math_score.mean(), inplace=True)
C:\Users\bhave\AppData\Local\Temp/ipykernel_4556/946556448.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  ds_score.fillna(ds_score.mean(), inplace=True)
C:\Users\bhave\AppData\Local\Temp/ipykernel_4556/946556448.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  physics_score.fillna(physics_score.mean(), inplace=True)

In [27]:
math_score.isnull().sum()

Name          0
Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [28]:
physics_score.isnull().sum()

Name          0
Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64

In [29]:
ds_score.isnull().sum()

Name          0
Score         0
Age           0
Ethinicity    0
Subject       0
Sex           0
ID            0
dtype: int64